Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-react-component_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: This is in contrast to `UNSAFE_componentWillReceiveProps`, which only fires when the parent causes a re-render and not as a result of a local `setState`.
ja: `UNSAFE_componentWillReceiveProps` は、ローカルの `setState()` に依らず、親が再レンダーを行ったときにのみ発生します。

source: `getSnapshotBeforeUpdate()` is invoked right before the most recently rendered output is committed to e.g. the DOM.
ja: `getSnapshotBeforeUpdate()` は、最後にレンダーされた出力が DOM などにコミットされる直前に呼び出されます。

source: It enables your component to capture some information from the DOM (e.g. scroll position) before it is potentially changed.
ja: これはコンポーネントが変更される可能性があるときに、変更される前に DOM から何らかの情報（たとえば、スクロール位置）を取得しておくことを可能にします。

source: Any value returned by this lifecycle method will be passed as a parameter to `componentDidUpdate()`.
ja: このライフサイクルメソッドによって返された値はすべて、`componentDidUpdate()` へのパラメータとして渡されます。

source: This use case is not common, but it may occur in UIs like a chat thread that need to handle scroll position in a special way.
ja: このユースケースは一般的ではありませんが、スクロール位置を特別な方法で処理する必要があるチャットのスレッドのような UI で発生する可能性があります。

source: A snapshot value (or `null`) should be returned.
ja: スナップショット値（または `null`）が返されるべきです。

source: For example:
ja: 例：

source: In the above examples, it is important to read the `scrollHeight` property in `getSnapshotBeforeUpdate` because there may be delays between "render" phase lifecycles (like `render`) and "commit" phase lifecycles (like `getSnapshotBeforeUpdate` and `componentDidUpdate`).
ja: この例では、`getSnapshotBeforeUpdate` の中で `scrollHeight` プロパティを読み取ることが重要です。これは、（`render` のような）「描画」フェーズライフサイクルと（`getSnapshotBeforeUpdate` および `componentDidUpdate` のような）「コミット」フェーズライフサイクルの間に遅延が生じるためです。

source: ### Error boundaries {#error-boundaries}
ja: ### error boundary {#error-boundaries}

source: [Error boundaries](/docs/error-boundaries.html) are React components that catch JavaScript errors anywhere in their child component tree, log those errors, and display a fallback UI instead of the component tree that crashed.
ja: [error boundary](/docs/error-boundaries.html) は、子コンポーネントツリーのどこかで JavaScript エラーを捕捉し、それらのエラーを記録し、クラッシュしたコンポーネントツリーの代わりにフォールバック UI を表示する React コンポーネントです。

source: Error boundaries catch errors during rendering, in lifecycle methods, and in constructors of the whole tree below them.
ja: error boundary は、その下のツリー全体のレンダー中、ライフサイクルメソッド内、およびコンストラクタ内で発生したエラーを捕捉します。

source: A class component becomes an error boundary if it defines either (or both) of the lifecycle methods `static getDerivedStateFromError()` or `componentDidCatch()`.
ja: クラスコンポーネントは、ライフサイクルメソッド `static getDerivedStateFromError()` または `componentDidCatch()` のいずれか（または両方）を定義すると、error boundary になります。

source: Updating state from these lifecycles lets you capture an unhandled JavaScript error in the below tree and display a fallback UI.
ja: これらのライフサイクルから state を更新すると、下のツリーで発生した未処理の JavaScript エラーを捕捉してフォールバック UI を表示できます。

source: Only use error boundaries for recovering from unexpected exceptions; **don't try to use them for control flow.**
ja: error boundary は予期しない例外からの回復のためだけに使用してください。**それらを制御フローに使用しないでください**。

source: For more details, see [*Error Handling in React 16*](/blog/2017/07/26/error-handling-in-react-16.html).
ja: 詳細については、[*React 16 のエラーハンドリング*](/blog/2017/07/26/error-handling-in-react-16.html)を参照してください。

source: > Note > > Error boundaries only catch errors in the components **below** them in the tree.
ja: > 補足 > > error boundary は、ツリー内でその**下**にあるコンポーネント内のエラーのみを捕捉します。

source: An error boundary can’t catch an error within itself.
ja: error boundary はそれ自体の中でエラーを捉えることはできません。

source: This lifecycle is invoked after an error has been thrown by a descendant component.
ja: このライフサイクルは、子孫コンポーネントによってエラーがスローされた後に呼び出されます。

source: It receives the error that was thrown as a parameter and should return a value to update state.
ja: パラメータとしてスローされたエラーを受け取り、state を更新するための値を返すべきです。

source: // Update state so the next render will show the fallback UI.
ja: // 次のレンダーでフォールバック UI が表示されるように state を更新する

source: // You can render any custom fallback UI
ja: // 任意のフォールバック UI をレンダーできます

source: > Note > > `getDerivedStateFromError()` is called during the "render" phase, so side-effects are not permitted.
ja: > 補足 > > `getDerivedStateFromError()` は「描画」フェーズ中に呼び出されるので、副作用は許可されていません。

source: For those use cases, use `componentDidCatch()` instead.
ja: そのような場合は、代わりに `componentDidCatch()` を使用してください。

source: It receives two parameters:
ja: 以下の 2 つのパラメータを受け取ります。

source: `error` - The error that was thrown.
ja: `error` - スローされたエラー 2.

source: 2. `info` - An object with a `componentStack` key containing [information about which component threw the error](/docs/error-boundaries.html#component-stack-traces).
ja: `info` - [どのコンポーネントがエラーをスローしたかについての情報](/docs/error-boundaries.html#component-stack-traces)を含む `componentStack` キーを持つオブジェクト

source: `componentDidCatch()` is called during the "commit" phase, so side-effects are permitted.
ja: `componentDidCatch()` は「コミット」フェーズ中に呼び出されるため、副作用は許可されています。

source: It should be used for things like logging errors:
ja: ロギング時のエラーなどのために使用されるべきです。

source: Production and development builds of React slightly differ in the way `componentDidCatch()` handles errors.
ja: React の本番用ビルドと開発用ビルドでは、`componentDidCatch()` がエラーを処理する方法がわずかに異なります。

source: On development, the errors will bubble up to `window`, this means that any `window.onerror` or `window.addEventListener('error', callback)` will intercept the errors that have been caught by `componentDidCatch()`.
ja: 開発用ビルドでは、エラーは `window` までバブリングするため、`componentDidCatch()` が捕捉したエラーを `window.onerror` や `window.addEventListener('error', callback)` でもインターセプトすることができます。

source: On production, instead, the errors will not bubble up, which means any ancestor error handler will only receive errors not explicitly caught by `componentDidCatch()`.
ja: 一方で本番用ビルドではエラーはバブリングしないため、祖先要素のエラーハンドラは `componentDidCatch()` で明示的に捕捉されていないエラーのみを受け取ります。

source: > Note > > In the event of an error, you can render a fallback UI with `componentDidCatch()` by calling `setState`, but this will be deprecated in a future release.
ja: > 補足 > > エラーが発生した場合は、`setState` を呼び出す `componentDidCatch()` を使用してフォールバック UI をレンダーできますが、これは将来のリリースでは推奨されなくなります。

source: > Use `static getDerivedStateFromError()` to handle fallback rendering instead.
ja: > 代わりにフォールバックの描画を扱うために、`static getDerivedStateFromError()` を使用してください。

source: ### Legacy Lifecycle Methods {#legacy-lifecycle-methods}
ja: ### レガシーなライフサイクルメソッド {#legacy-lifecycle-methods}

source: The lifecycle methods below are marked as "legacy".
ja: 以下のライフサイクルメソッドは「レガシー」としてマークされています。

source: They still work, but we don't recommend using them in the new code.
ja: 動作はしますが、新しいコードで使用することはおすすめしません。

source: You can learn more about migrating away from legacy lifecycle methods in [this blog post](/blog/2018/03/27/update-on-async-rendering.html).
ja: この[ブログ記事](/blog/2018/03/27/update-on-async-rendering.html)では、レガシーなライフサイクルメソッドからの移行についてさらに学ぶことができます。

source: > Note > > This lifecycle was previously named `componentWillMount`.
ja: > 補足 > > このライフサイクルは、以前は `componentWillMount` という名前でした。

source: That name will continue to work until version 17.
ja: その名前はバージョン 17 まで機能し続けます。

source: Use the [`rename-unsafe-lifecycles` codemod](https://github.com/reactjs/react-codemod#rename-unsafe-lifecycles) to automatically update your components.
ja: コンポーネントを自動的に更新するには、[`rename-unsafe-lifecycles` codemod](https://github.com/reactjs/react-codemod#rename-unsafe-lifecycles) を使用してください。

source: `UNSAFE_componentWillMount()` is invoked just before mounting occurs.
ja: マウントが行われる直前に `UNSAFE_componentWillMount()` が呼び出されます。

source: It is called before `render()`, therefore calling `setState()` synchronously in this method will not trigger an extra rendering.
ja: これは `render()` の前に呼び出されるので、このメソッドで `setState()` を同期的に呼び出しても余分なレンダーは行われません。

source: Generally, we recommend using the `constructor()` instead for initializing state.
ja: 一般に、state を初期化するためには代わりに `constructor()` を使うことをおすすめします。

source: Avoid introducing any side-effects or subscriptions in this method.
ja: このメソッドでは、副作用や購読を導入しないでください。

source: This is the only lifecycle method called on server rendering.
ja: これは、サーバレンダリングで呼び出される唯一のライフサイクルメソッドです。

source: > Note > > This lifecycle was previously named `componentWillReceiveProps`.
ja: > 補足 > > このライフサイクルは、以前は `componentWillReceiveProps` という名前でした。

source: > Note: > > Using this lifecycle method often leads to bugs and inconsistencies
ja: > 補足: > > > このライフサイクルメソッドを使用すると、しばしばバグや矛盾が発生します。

source: > > * If you need to **perform a side effect** (for example, data fetching or an animation) in response to a change in props, use [`componentDidUpdate`](#componentdidupdate) lifecycle instead.
ja: > > * props の変更に応じて**副作用を実行する**必要がある場合は（データの取得やアニメーションなど）、代わりに [`componentDidUpdate`](#componentdidupdate) ライフサイクルを使用してください

source: > * If you used `componentWillReceiveProps` for **re-computing some data only when a prop changes**, [use a memoization helper instead](/blog/2018/06/07/you-probably-dont-need-derived-state.html#what-about-memoization).
ja: > * `componentWillReceiveProps` を **props が変更されたときにのみデータを再計算する**ために使う代わりに、[メモ化ヘルパーを使用してください](/blog/2018/06/07/you-probably-dont-need-derived-state.html#what-about-memoization)

source: > * If you used `componentWillReceiveProps` to **"reset" some state when a prop changes**, consider either making a component [fully controlled](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-controlled-component) or [fully uncontrolled with a `key`](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key) instead.
ja: > * `componentWillReceiveProps` を **props が変更されたときに何かの state を「リセット」する**ために使う代わりに、コンポーネントを[完全に制御する](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-controlled-component)か、または [`key` を使って全く制御しない](/blog/2018/06/07/you-probably-dont-need-derived-state.html#recommendation-fully-uncontrolled-component-with-a-key)かを検討してください

source: > > For other use cases, [follow the recommendations in this blog post about derived state](/blog/2018/06/07/you-probably-dont-need-derived-state.html).
ja: > > その他の使用例については、[派生 state に関するこのブログ投稿の推奨事項に従ってください](/blog/2018/06/07/you-probably-dont-need-derived-state.html)。

source: `UNSAFE_componentWillReceiveProps()` is invoked before a mounted component receives new props.
ja: `UNSAFE_componentWillReceiveProps()` は、マウントされたコンポーネントが新しい props を受け取る前に呼び出されます。

source: If you need to update the state in response to prop changes (for example, to reset it), you may compare `this.props` and `nextProps` and perform state transitions using `this.setState()` in this method.
ja: prop の変更に応じて state を更新する必要がある場合（たとえばリセットする必要がある場合）は、`this.props` と `nextProps` を比較し、このメソッドで `this.setState()` を使用して状態遷移を実行できます。

source: Note that if a parent component causes your component to re-render, this method will be called even if props have not changed.
ja: 親コンポーネントによってコンポーネントが再レンダーされる場合、props が変更されていなくてもこのメソッドが呼び出されることに注意してください。

source: Make sure to compare the current and next values if you only want to handle changes.
ja: 変更だけを処理したい場合は、必ず現在の値と次の値を比較してください。

source: React doesn't call `UNSAFE_componentWillReceiveProps()` with initial props during [mounting](#mounting).
ja: [マウント](#mounting)時に、React は最初の props で `UNSAFE_componentWillReceiveProps()` を呼び出しません。

source: It only calls this method if some of component's props may update.
ja: 一部のコンポーネントの props が更新される可能性がある場合にのみ、このメソッドを呼び出します。

source: Calling `this.setState()` generally doesn't trigger `UNSAFE_componentWillReceiveProps()`.
ja: `this.setState()` を呼び出しても、通常 `UNSAFE_componentWillReceiveProps()` は呼び出されません。

source: > Note > > This lifecycle was previously named `componentWillUpdate`.
ja: > 補足 > > このライフサイクルは、以前は `componentWillUpdate` と呼ばれていました。

source: `UNSAFE_componentWillUpdate()` is invoked just before rendering when new props or state are being received.
ja: `UNSAFE_componentWillUpdate()` は、新しい props または state を受け取ったときにレンダーの直前に呼び出されます。

source: Use this as an opportunity to perform preparation before an update occurs.
ja: 更新が発生する前の準備する機会としてこれを使用してください。このメソッドは最初のレンダーでは呼び出されません。

source: Note that you cannot call `this.setState()` here; nor should you do anything else (e.g. dispatch a Redux action) that would trigger an update to a React component before `UNSAFE_componentWillUpdate()` returns.
ja: また、`UNSAFE_componentWillUpdate()` が返る前に React コンポーネントへの更新を引き起こすような何か他のこと（たとえば、Redux アクションのディスパッチ）をするべきでもありません。

source: Typically, this method can be replaced by `componentDidUpdate()`.
ja: 通常、このメソッドは `componentDidUpdate()` に置き換えることができます。

source: If you were reading from the DOM in this method (e.g. to save a scroll position), you can move that logic to `getSnapshotBeforeUpdate()`.
ja: このメソッドで DOM から読んでいる場合（スクロール位置を保存するなど）は、そのロジックを `getSnapshotBeforeUpdate()` に移動できます。

source: > Note > > `UNSAFE_componentWillUpdate()` will not be invoked if [`shouldComponentUpdate()`](#shouldcomponentupdate) returns false.
ja: > 補足 > > [`shouldComponentUpdate()`](#shouldcomponentupdate) が false を返した場合、`UNSAFE_componentWillUpdate()` は呼び出されません。

source: ## Other APIs {#other-apis-1}
ja: ## 他の API {#other-apis-1}

source: Unlike the lifecycle methods above (which React calls for you), the methods below are the methods *you* can call from your components.
ja: 上記のライフサイクルメソッド（React が呼び出すもの）とは異なり、以下のメソッドは*あなたが*コンポーネントから呼び出すことができるメソッドです。

source: There are just two of them: `setState()` and `forceUpdate()`.
ja: それは `setState()` と `forceUpdate()` の 2 つだけです。

source: `setState()` enqueues changes to the component state and tells React that this component and its children need to be re-rendered with the updated state.
ja: `setState()` はコンポーネントの state への変更をエンキューし、このコンポーネントとその子を更新された state で再レンダーする必要があることを React に伝えます。

source: This is the primary method you use to update the user interface in response to event handlers and server responses.
ja: これは、イベントハンドラとサーバの応答に応じてユーザインターフェイスを更新するために使用する主な方法です。

source: Think of `setState()` as a *request* rather than an immediate command to update the component.
ja: `setState()` は、コンポーネントを更新するための即時のコマンドではなく、**要求**として考えてください。

source: For better perceived performance, React may delay it, and then update several components in a single pass.
ja: パフォーマンスをよくするために、React はそれを遅らせて、単一パスで複数のコンポーネントを更新することがあります。

source: React does not guarantee that the state changes are applied immediately.
ja: React は state の変更がすぐに適用されることを保証しません。

source: `setState()` does not always immediately update the component.
ja: `setState()` は常にコンポーネントを直ちに更新するわけではありません。

source: It may batch or defer the update until later.
ja: それはバッチ式に更新するか後で更新を延期するかもしれません。

source: This makes reading `this.state` right after calling `setState()` a potential pitfall.
ja: これは `setState()` を呼び出した直後に `this.state` を読み取ることが潜在的な危険になります。

source: Instead, use `componentDidUpdate` or a `setState` callback (`setState(updater, callback)`), either of which are guaranteed to fire after the update has been applied.
ja: 代わりに、`componentDidUpdate` または `setState` コールバック（`setState(updater, callback)`）を使用してください。どちらも更新が適用された後に起動することが保証されています。

source: If you need to set the state based on the previous state, read about the `updater` argument below.
ja: 前の state に基づいて state を設定する必要がある場合は、下記の `updater` 引数についてお読みください。

source: `setState()` will always lead to a re-render unless `shouldComponentUpdate()` returns `false`.
ja: `shouldComponentUpdate()` が `false` を返さない限り、`setState()` は常に再レンダーされます。

source: If mutable objects are being used and conditional rendering logic cannot be implemented in `shouldComponentUpdate()`, calling `setState()` only when the new state differs from the previous state will avoid unnecessary re-renders.
ja: ミュータブルなオブジェクトが使用されていて、条件付きでレンダーを行うためのロジックを `shouldComponentUpdate()` に実装できない場合、新しい state が前の state と異なるときにのみ `setState()` を呼び出すと、不要な再レンダーを回避できます。

source: The first argument is an `updater` function with the signature:
ja: 最初の引数の `updater` 関数は次のようなシグネチャです。

source: `state` is a reference to the component state at the time the change is being applied.
ja: `state` は、変更が適用されているときのコンポーネントの state への参照です。

source: It should not be directly mutated.
ja: 直接変更するべきではありません。

source: Instead, changes should be represented by building a new object based on the input from `state` and `props`.
ja: 代わりに、`state` と `props` からの入力に基づいて新しいオブジェクトを構築することによって変更を表現する必要があります。

source: For instance, suppose we wanted to increment a value in state by `props.step`:
ja: たとえば、`props.step` によって `state` の値を増加したいとします。

source: Both `state` and `props` received by the updater function are guaranteed to be up-to-date.
ja: updater 関数が受け取る `state` と `props` の両方が最新のものであることが保証されています。

source: The output of the updater is shallowly merged with `state`.
ja: アップデータの出力は `state` と浅くマージされています。

source: The second parameter to `setState()` is an optional callback function that will be executed once `setState` is completed and the component is re-rendered.
ja: `setState()` の 2 番目のパラメータは、`setState` が完了してコンポーネントが再レンダーされると実行される省略可能なコールバック関数です。

source: Generally we recommend using `componentDidUpdate()` for such logic instead.
ja: 通常、そのようなロジックには代わりに `componentDidUpdate()` を使用することをおすすめします。

source: You may optionally pass an object as the first argument to `setState()` instead of a function:
ja: 関数の代わりに、オブジェクトを `setState()` の最初の引数として渡すこともできます。

source: This performs a shallow merge of `stateChange` into the new state, e.g., to adjust a shopping cart item quantity:
ja: これは、たとえば、ショッピングカートの商品数を調整するために、`stateChange` の新しい state への浅いマージを実行します。

source: This form of `setState()` is also asynchronous, and multiple calls during the same cycle may be batched together.
ja: この形式の `setState()` も非同期であり、同じサイクル中の複数の呼び出しをまとめてバッチ処理することができます。

source: For example, if you attempt to increment an item quantity more than once in the same cycle, that will result in the equivalent of:
ja: たとえば、同じサイクルで品目数量を複数回増やそうとすると、次のようになります。

source: Subsequent calls will override values from previous calls in the same cycle, so the quantity will only be incremented once.
ja: 後続の呼び出しは、同じサイクル内の前の呼び出しの値を上書きするため、数量は 1 回だけ増分されます。

source: If the next state depends on the current state, we recommend using the updater function form, instead:
ja: 次の state が現在の state に依存する場合は、代わりに updater 関数の形式を使用することをおすすめします。

source: For more detail, see:
ja: 詳しくは以下を参照してください。

source: * [State and Lifecycle guide](/docs/state-and-lifecycle.html)
ja: * [state と ライフサイクル](/docs/state-and-lifecycle.html)

source: * [In depth: When and why are `setState()` calls batched?](https://stackoverflow.com/a/48610973/458193)
ja: * [詳細: `setState()` はいつ、なぜバッチ処理されるのですか？](https://stackoverflow.com/a/48610973/458193)

source: * [In depth: Why isn't `this.state` updated immediately?](https://github.com/facebook/react/issues/11527#issuecomment-360199710)
ja: * [詳細: `this.state` が直ちに更新されないのはなぜですか？](https://github.com/facebook/react/issues/11527#issuecomment-360199710)

source: By default, when your component's state or props change, your component will re-render.
ja: デフォルトでは、コンポーネントの state や props が変わると、コンポーネントは再レンダーされます。

source: If your `render()` method depends on some other data, you can tell React that the component needs re-rendering by calling `forceUpdate()`.
ja: `render()` メソッドが他のデータに依存している場合は、`forceUpdate()` を呼び出してコンポーネントの再レンダーが必要であることを React に伝えることができます。

source: Calling `forceUpdate()` will cause `render()` to be called on the component, skipping `shouldComponentUpdate()`.
ja: `forceUpdate()` を呼び出すと、`shouldComponentUpdate()` をスキップして、コンポーネントに対して `render()` が呼び出されます。

source: This will trigger the normal lifecycle methods for child components, including the `shouldComponentUpdate()` method of each child.
ja: これにより、それぞれの子の `shouldComponentUpdate()` メソッドを含む、子コンポーネントの通常のライフサイクルメソッドがトリガーされます。

source: React will still only update the DOM if the markup changes.
ja: マークアップが変更された場合にのみ React は DOM を更新します。

source: Normally you should try to avoid all uses of `forceUpdate()` and only read from `this.props` and `this.state` in `render()`.
ja: 通常は全ての `forceUpdate()` の使用を避け、`render()` の `this.props` と `this.state` からのみ読み取るようにしてください。

source: ## Class Properties {#class-properties-1}
ja: ## クラスプロパティ {#class-properties-1}

source: `defaultProps` can be defined as a property on the component class itself, to set the default props for the class.
ja: `defaultProps` は、コンポーネントクラス自体のプロパティとして定義して、そのクラスのデフォルトの props を設定できます。

source: This is used for `undefined` props, but not for `null` props.
ja: これは `undefined` であるプロパティに使用されますが、`null` であるプロパティには使用されません。

source: If `props.color` is not provided, it will be set by default to `'blue'`:
ja: `props.color` が提供されていない場合は、デフォルトで `'blue'` に設定されます。

source: return <CustomButton /> ; // props.color will be set to blue
ja: return <CustomButton /> ; // props.color は blue にセットされます

source: If `props.color` is set to `null`, it will remain `null`:
ja: `props.color` が `null` に設定されている場合、それは `null` のままになります。

source: return <CustomButton color={null} /> ; // props.color will remain null
ja: return <CustomButton color={null} /> ; // props.color は null のままになります

source: The `displayName` string is used in debugging messages.
ja: `displayName` 文字列はデバッグメッセージに使用されます。

source: Usually, you don't need to set it explicitly because it's inferred from the name of the function or class that defines the component.
ja: 通常、コンポーネントを定義する関数またはクラスの名前から推測されるため、明示的に設定する必要はありません。

source: You might want to set it explicitly if you want to display a different name for debugging purposes or when you create a higher-order component, see [Wrap the Display Name for Easy Debugging](/docs/higher-order-components.html#convention-wrap-the-display-name-for-easy-debugging) for details.
ja: デバッグ目的で別の名前を表示する場合や、高階コンポーネントを作成する場合には、明示的に設定したくなるかもしれません。詳細については、[簡単なデバッグのために表示名をラップする](/docs/higher-order-components.html#convention-wrap-the-display-name-for-easy-debugging)を参照してください。

source: ## Instance Properties {#instance-properties-1}
ja: ## インスタンスプロパティ {#instance-properties-1}

source: `this.props` contains the props that were defined by the caller of this component.
ja: `this.props` には、このコンポーネントの呼び出し元によって定義された props が含まれています。

source: See [Components and Props](/docs/components-and-props.html) for an introduction to props.
ja: props の紹介は [コンポーネントと props](/docs/components-and-props.html) を見てください。

source: In particular, `this.props.children` is a special prop, typically defined by the child tags in the JSX expression rather than in the tag itself.
ja: 特に、`this.props.children` は特別なプロパティで、通常はタグ自体にではなく JSX 式の子タグによって定義されます。

source: The state contains data specific to this component that may change over time.
ja: state には、そのコンポーネント固有のデータが含まれており、これは時間の経過とともに変化する可能性があります。

source: The state is user-defined, and it should be a plain JavaScript object.
ja: state はユーザ定義のものであり、プレーンな JavaScript オブジェクトでなければなりません。

source: If some value isn't used for rendering or data flow (for example, a timer ID), you don't have to put it in the state.
ja: レンダーやデータフローに値が使用されていない場合（たとえば、タイマー ID）は、値を state にする必要はありません。

source: Such values can be defined as fields on the component instance.
ja: そのような値は、コンポーネントインスタンスのフィールドとして定義できます。

source: See [State and Lifecycle](/docs/state-and-lifecycle.html) for more information about the state.
ja: state の詳細については、[state とライフサイクル](/docs/state-and-lifecycle.html)を参照してください。

source: Never mutate `this.state` directly, as calling `setState()` afterwards may replace the mutation you made.
ja: 後で `setState()` を呼び出すと、行った変更が置き換えられる可能性があるため、`this.state` を直接変更しないでください。

source: Treat `this.state` as if it were immutable.
ja: `this.state` がイミュータブルであるかのように扱ってください。
